csci2670/notesMaster.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-19 Tue 12:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Sudhan Chitgopkar" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga2ad378">1. 01.14.21</a>
<ul>
<li><a href="#orgacd8997">1.1. Automaton (automata)</a></li>
<li><a href="#org09f5706">1.2. The Mathematics of Automata</a>
<ul>
<li><a href="#org2e1c5c2">1.2.1. Mathematicians &amp; History</a></li>
<li><a href="#org3679c25">1.2.2. Sequential Logic</a></li>
</ul>
</li>
<li><a href="#org4548189">1.3. Necessary Review</a></li>
<li><a href="#org9f183cf">1.4. Functions</a></li>
<li><a href="#org9a2b123">1.5. <span class="todo TODO">TODO</span> Types of Functions - Definition &amp; Logical Statement</a></li>
<li><a href="#org8acb6b9">1.6. Finite Automaton (Finite State Machine)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga2ad378" class="outline-2">
<h2 id="orga2ad378"><span class="section-number-2">1</span> 01.14.21</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgacd8997" class="outline-3">
<h3 id="orgacd8997"><span class="section-number-3">1.1</span> Automaton (automata)</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Self running machine requiring a continuous power source
<ul class="org-ul">
<li>Historically used power sources include water, steam, and electricity</li>
</ul></li>
<li>Course revolves around defining the mathematics powering machines</li>
</ul>
</div>
</div>
<div id="outline-container-org09f5706" class="outline-3">
<h3 id="org09f5706"><span class="section-number-3">1.2</span> The Mathematics of Automata</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org2e1c5c2" class="outline-4">
<h4 id="org2e1c5c2"><span class="section-number-4">1.2.1</span> Mathematicians &amp; History</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>Cantor defines sets as collections of objects</li>
<li>Cantor also argues that infinites can be of different magnitudes - there are infinitely more real numbers than natural numbers</li>
<li>Goedel eventually derives his incompleteness theorem
<ul class="org-ul">
<li>No logical system that contains the natural numbers can prove its own soundness</li>
<li>Every sound logical system containing the natural numbers contains valid statements that cannot be proved or disproved</li>
</ul></li>
<li>In 1936, Turing proves The Halting Problem is not decidable, it is impossible
<ul class="org-ul">
<li>The Halting Problem is an algorithm that can analyze any other algorithm and determine whether or not it goes into an infinite loop</li>
</ul></li>
<li>Turing creates the turing machine as an object consisting of sets and processes wherein the object can use any finite process to complete an action.</li>
<li>Turing machine sets the basis for a computer, which leads to a series of important questions:
<ul class="org-ul">
<li>What can &amp; can&rsquo;t a machine do?</li>
<li>What does it mean for a problem ot be harder than another?</li>
<li>What does it mean for a machine to be more powerfule than another?</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3679c25" class="outline-4">
<h4 id="org3679c25"><span class="section-number-4">1.2.2</span> Sequential Logic</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>Sentential Logic- based on boolean results
<ul class="org-ul">
<li>Predicated on AND, OR, NOT</li>
<li>XOR, XAND, etc. can be derived using the above</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4548189" class="outline-3">
<h3 id="org4548189"><span class="section-number-3">1.3</span> Necessary Review</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Textbook Ch. 0</li>
<li>Logic Statements</li>
<li>Set Theory</li>
<li>Functions</li>
</ul>
</div>
</div>
<div id="outline-container-org9f183cf" class="outline-3">
<h3 id="org9f183cf"><span class="section-number-3">1.4</span> Functions</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Functions - something that maps objects from one set to another</li>
<li>Given f: a &rarr; b;
<ul class="org-ul">
<li>Everything in a is mapped to something in b
<ul class="org-ul">
<li>For every x, such that x is an element of a, there exists a y, such that y is an element of b</li>
</ul></li>
<li><p>
No one point in the domain can be mapped to two different points in the codomain
</p>
<ul class="org-ul">
<li>Logically, you can&rsquo;t have a function that takes in one input and returns two different outputs</li>
<li>If f maps x &rarr; y1 and &rarr; y2, y1 = y2</li>
</ul>
<p>
-&forall; x &isin; A y<sub>1,y</sub><sub>2</sub> &isin; B [f(x)=y1&and; f(x)=y2 &rarr; y1 = y2]
</p></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org9a2b123" class="outline-3">
<h3 id="org9a2b123"><span class="section-number-3">1.5</span> <span class="todo TODO">TODO</span> Types of Functions - Definition &amp; Logical Statement</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Injective Functions</li>
<li>Surjective Functions</li>
<li>Proof by Induction (&forall;)</li>
<li>Proof by Contradiction (&not;&exist;)</li>
</ul>
</div>
</div>
<div id="outline-container-org8acb6b9" class="outline-3">
<h3 id="org8acb6b9"><span class="section-number-3">1.6</span> Finite Automaton (Finite State Machine)</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>States are logical confirgurations</li>
<li>States are generally based upon input</li>
<li>Purpose of a state machine is to make a yes/no decision</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Sudhan Chitgopkar</p>
<p class="date">Created: 2021-01-19 Tue 12:52</p>
</div>
</body>
</html>
